# TIL 025-09-02<br />
## 1과목 데이터 모델링의 이해

### CH.01 데이터 모델링의 이해
<br />

### 1. 데이터 모델링의 개념 및 특징

데이터 모델링 : 단순하고 이해하기 쉬운 구조로 표현하는 과정

- 추상화 : 현실의 복잡한 데이터를 **중요한 정보만 남기고 표현**하는 과정
- 단순화 : 복잡한 데이터를 **이해하기 쉬운 구조로 표현**하는 과정
- 명확화 : 데이터의 구조와 **관계를 명확하게 표현**하는 것

외우는 방법 : 내 친구의 눈은 “단추구멍”

### 주의사항

- 중복성 : 같은 데이터가 여러곳에 저장되어 올바르게 수행되지 않을 수 있다.
- 비유연성 : 변화에 대응하지 못해 시스템 확장, 수정이 어려울 수 있다.
- 비일관성 : 다르게 정보가 저장되어 신뢰성이 저하될 수 있다.

외우는 방법 : 내 친구는 “유일중” 학교를 졸업했어.

## 데이터 모델링의 관점

1. 데이터 관점

저장, 관리해야 하는 데이터 자체에 초점을 맞추어, 데이터 간의 모델링을 다룬다.

2. 프로세스 관점

데이터 관점과 달리, 프로세스 관점은 데이터를 어떻게 처리할 지에 초점을 맞춘다.

3. 데이터와 프로세스의 상관 관점

데이터와 프로세스가 **서로 밀접하게 연결**되어 있는 것을 강조하는 것이다.

## 데이터 모델링의 3단계

1. 개념적 데이터 모델링
    - **현실 세계의 데이터를 추상화** 하여 개념적 구조를 설계한다.
2. 논리적 데이터 모델링
    - 개념적 구조를 바탕으로 **논리적 단계와 데이터 속성을 정의 하여 논리적 구조를 설계**한다.
3. 물리적 데이터 모델링
    - 논리적 구조를 기반으로 **데이터를 저장할 구체적인 방식** (물리적 구조)을 설계한다.

외우는 방법 : 내 친구는 “개논 괴물” 이다.

## 데이터베이스와 파일의 차이

1. 데이터 중복 관리
    - 파일은 데이터 종복이 일어날 수 있지만, DB는 그렇지 않다.
2. 데이터 불일치 문제
    - 파일 시스템에서 데이터를 변경하였을 때 다른 파일에서 수정되지 않고, 그대로 남아있는 경우가 생길 수 있다.

## 데이터베이스 시스템

DB 시스템은 **데이터의 중복 관리를 제거**하고, **데이터의 일관성을 유지**하며, **효율적으로 데이터를 공유**하기 위한 시스템이다.

1. 데이터의 통합 관리
    - 하나의 데이터베이스에서 통합 관리한다.
2. 데이터 공유와 일관성 유지
    - 여러 프로그램이 공유하여 사용하므로, 데이터가 일관성을 유지할 수 있다.

## 데이터 베이스 3단계 구조

- 외부 스키마 : **응용프로그램, 사용자 관점**에서 데이터를 표현한 것.
- 개념 스키마 : 외부 스키마에서 요구된 **모든 데이터를 통합**하여 **설계한 데이터의 논리적 구조**를 말한다.
- 내부 스키마 : 개념 스키마를 **물리적으로 저장**하는 구조를 말한다.

외우는 방법 : “외개내”

## 데이터의 종속성과 독립성

1. 데이터 종속성
    - **응용프로그램과 데이터 간의 상호 의존 관계**를 의미한다.
2. 데이터 독립성
    - 데이터 구조의 변경이 응용 프로그램에 **영향을 주지 않는 특성**을 의미한다.

## 데이터 독립성이 유지되지 않는 경우

1. 데이터 중복성, 복잡성이 증가한다.
2. 요구 사항에 대응하는 난이도가 증가하여 데이터 유지 보수 비용이 상승한다.

## 데이터 모델링의 요소

1. 엔티티 : **대상 (Thing)**을 의미한다.
2. 속성 : **Attibute**로 엔티티가 가지는 **특성, 정보**를 말한다.
3. 관계 : **Relationship**으로 엔티티 간의 **연결, 상호작용**을 의미한다.

외우는 방법 : 타(TAR)

## 스키마 VS 인스턴스

1. 스키마 : DB의 구조, 설계를 정의한 것으로 정적인 개념이다.(주제를 의미한다.)
2. 인스턴스 : 스키마에 따라 저장된 실제 데이터를 말하며, 동적인 개념이다.

![image.png](attachment:3ee474bd-9c18-4d4c-ac06-e87cdbd51c67:image.png)

## ERD 작성 순서

1. 엔티티를 도출하고 그린다.
2. 엔티티를 적절하게 배치한다.
3. 엔티티 간의 관계를 설정한다.
4. 관계명을 서술한다 (양방향)
5. 관계 참여도를 표현한다. → 1 : 1, 1 : N, N : M
6. 관계의 필수 여부를 확인한다.

## 엔티티의 분류

### 물리적 형태

1. 유형 엔티티 : 물리적인 형태가 있다.
2. 개념 엔티티 : 물리적인 형태가 있진 않지만 관리해야 할 개념적 정보이다.
3. 사건 엔티티 : 업무 수행 과정에서 발생하는 것이다.

## 내 생각

SQLD 자격증을 공부하면서 유치하지만, 자신만의 외우는 방법을 이용해서 공부하는 것도 좋은 공부방법이 될 수 있을 것 같다.